{"hilfetexte":[ 
    {"Titel":"Was ist Sudoku?", "Hilfetext":"Sudoku ist ein Logikrätsel. Es handelt sich dabei um ein durch Logik zu lösendes Anordnungsproblem. Die moderne Form des Sudoku wurde von Howard Garns erfunden. Erstmals im Jahr 1979 unter dem Namen Number Place in einer Rätselzeitschrift in den Vereinigten Staaten veröffentlicht, wurde es erst ab 1984 zunächst in Japan populär, wo es auch seinen heutigen Namen Sudoku erhielt."}, 
    {"Titel":"Das Ziel eines Sudoku", "Hilfetext":"In der üblichen Version ist es das Ziel, ein 9×9-Gitter mit den Ziffern 1 bis 9 so zu füllen, dass jede Ziffer in jeder Spalte, in jeder Zeile und in jedem Block (3×3-Unterquadrat) genau einmal vorkommt – und natürlich in jedem der 81 Felder exakt eine Ziffer eingetragen wird. Ausgangspunkt ist ein Gitter, in dem bereits mehrere Ziffern vorgegeben sind. Je nach Größe des Sudokus variiert auch die Anzahl des Gitters und die Blöcke. Die vorhanden Größen sind hierbei: 9x9, 16x16, 25x25, 36x36"},
    {"Titel":"Größe des Sudoku wählen", "Hilfetext": "Um die Größe des Sudoku wählen zu können, klicken Sie im Startfenster auf eines der unteren Buttons. Oder Sie können auf den Reiter „Sudoku“ klicken, danach auf „Größe ändern“. Anschließend können Sie sich für ein der Größen entscheiden."},
    {"Titel":"Sudoku zurücksetzen", "Hilfetext": "Um ein Sudoku zurückzusetzen, klicken sie zunächst auf „Sudoku“ in der obigen Leiste und anschließend auf „Sudoku zurücksetzen“. Die Zahlen im vorhanden Sudoku werden nun gelöscht."},
    {"Titel":"Ein Sudoku generieren", "Hilfetext": "Hierbei werden zufällige Zahlen in ein Sudoku-Spiel generiert. Um ein Sudoku zu generieren, stellen Sie erst die Größe ein. Anschließend klicken Sie unter „Sudoku“ auf „Sudoku zufällig generieren“. Wurde zuvor keine Größe gewählt, so wird das zu generierende Sudoku als 9x9 Sudoku generiert."},
    {"Titel":"Eingaben überprüfen lassen", "Hilfetext": "Um ihre Eingaben überprüfen zu lassen und somit zu erfahren ob Ihr Sudoku gelöst ist, klicken Sie auf den „Lösen“ Button unter dem schon vorhandenen Sudoku-Rätsel."},
    {"Titel":"Ein Sudoku lösen lassen", "Hilfetext": "Wollen Sie ein Sudoku lösen lassen, so klicken Sie auf den Reiter „Sudoku“ und anschließend auf „Eingaben“ überprüfen. Das Sudoku-Rätsel muss hierbei schon vorhanden sein."},
    {"Titel":"Sudoku importieren", "Hilfetext": "Um ein Sudoku zu importieren benötigen Sie zunächst eine vorher existierende Datei des Formates XML, JSON oder CSV. Nun klicken Sie auf den Import-Button in der obigen Leiste und wählen eines der zuvor erwähnten Formate aus. Es öffnet sich ein Fenster, wo abschließend die Datei auswählen und auf importieren drücken. Ist die gewählte Datei nicht valide, so erscheint eine Fehlermeldung."},
    {"Titel":"Sudoku Exportieren", "Hilfetext": "Um ein Sudoku zu exportieren klicken Sie den Export-Button in der obigen Leiste und wählen eines der gewünschten Formate aus. Vorhanden sind die Formate XML, JSON, CSV und PDF. Anschließend öffnet sich ein Fenster. Dort können Sie auswählen, wo die Datei gespeichert werden soll."},
    {"Titel":"Das Sudoku-Spiel beenden", "Hilfetext": "Um das Sudoku-Spiel zu beenden, klicken Sie auf Button in der obigen Leiste, dass mit einem „x“ gekennzeichnet ist. Oder klicken Sie auf den Reiter „Sudoku“ und anschließend auf „Beenden“."}
]
}


  